## 4.6 Combining and Exporting Data (Questions 3-7)

This script contains the following points:Â¶

3. Importing orders_products_combined dataset

4. Check the shape of the imported dataframe

5. Combine the 'orders_products_combined' dataframe with the 'products_checked' dataframe

6. Merge and confirm the results using the merge flag

7. Export the merged dataset as a PKL file

## Importing libraries to computer (Pandas, NumPy, and OS)

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os

## 03. Importing orders_products_combined dataset

In [2]:
# Creating a data importing shortcut called 'path' for the Instacart folder to make importing data easier and cleaner
path =r'/Users/drewsmith/Desktop/01-2023 Instacart Basket Analysis'

In [4]:
# Utilizing the created 'path' shortcut to import the merged dataset 
orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

## 04. Check the shape of the imported dataframe

In [5]:
# Shows row and column count for the merged dataframe
orders_products_combined.shape

(32434489, 11)

### Answer: Yes, the shape of the dataframe matches from the previous notebook.

## 05. Combine the 'orders_products_combined' dataframe with the 'products_checked' dataframe

### Importing 'products_checked' dataframe

In [6]:
# Utilizing the created 'path' shortcut to import the most up to date products dataset 
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

### Comparing outputs of each imported dataframe to determine a suitable way to combine them

#### --*orders_products_combined dataframe*

In [15]:
# Shows first 5 rows of dataframe
orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,True,196,1,0
1,2539329,1,1,2,8,NaN,True,14084,2,0
2,2539329,1,1,2,8,NaN,True,12427,3,0
3,2539329,1,1,2,8,NaN,True,26088,4,0
4,2539329,1,1,2,8,NaN,True,26405,5,0

In [14]:
# ***Removed the '_merge' column since it is not needed. 
orders_products_combined = orders_products_combined.drop(columns=['_merge'])

In [16]:
# Shows row and column count of dataframe
orders_products_combined.shape

(32434489, 10)

#### --*df_prods dataframe*

In [12]:
# Shows first 5 rows of dataframe
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [11]:
# ***Removed the 'Unnamed: 0' column since there was an error from exporting the data in a previous exercise. 
df_prods = df_prods.drop(columns=['Unnamed: 0'])

In [13]:
# Shows row and column count of dataframe
df_prods.shape

(49672, 5)

### Merging datasets

In [17]:
# Merges the 'df_prods' and 'orders_products_combined' datasets. It uses the 'product_id' column as its key, an inner join (default), and includes an indicator=true argument to check for a full match
prods_ords_merged = orders_products_combined.merge(df_prods, on = 'product_id', indicator = True)

In [18]:
# Shows first 5 rows of newly created combined dataframe
prods_ords_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

## 06. Confirm the results of the merge using the merge flag

In [19]:
# Sums up all values in the '_merge' column to see if the data merge is a full match or not
prods_ords_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [20]:
# Shows row and column count for the merged dataframe
prods_ords_merged.shape

(32404859, 15)

### Answer: Yes, the datasets were merged properly.

## 07. Export the merged dataset as a PKL file

In [21]:
# Export data to pkl
prods_ords_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))